app/controllers/cats_controller.rb

def yes_vote
    @cat1 = Cat.find(params[:cat1_id])
    @cat2 = Cat.find(params[:cat2_id])


    @cat1.totalvotes += 1

    @cat1.yesvotes += 1

    @cat1.save
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "cats" SET "yesvotes" = 2, "totalvotes" = 2, "updated_at" = '2012-04-17 23:19:15.921992' WHERE "cats"."id" = 1

  def create
    @cat = Cat.new(params[:cat])

    respond_to do |format|
      if @cat.save
---
INSERT INTO "cats" ("created_at", "image", "totalvotes", "updated_at", "yesvotes") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 17 Apr 2012 21:43:47 UTC +00:00], ["image", "http://i.imgur.com/03Tjx.jpg"], ["totalvotes", 1], ["updated_at", Tue, 17 Apr 2012 21:43:47 UTC +00:00], ["yesvotes", 1]]

  def update
    @cat = Cat.find(params[:id])

    respond_to do |format|
      if @cat.update_attributes(params[:cat])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "cats" SET "image" = 'http://i.imgur.com/M8C7j.png', "updated_at" = '2012-04-17 22:39:23.321143' WHERE "cats"."id" = 2