app/views/cats/index.html.erb


  	<%= Cat.find(4).picture.url %><br>
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", 5]]